ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G032/N32G032.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>COMP</name>
            <description>comparator</description>
            <groupName>COMP</groupName>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>COMP_1_2_3</name>
                <description>COMP1/2/3 interrupt</description>
                <value>31</value>
            </interrupt>
            <registers>
                <register>
                    <name>COMP_INTEN</name>
                    <displayName>COMP_INTEN</displayName>
                    <description>COMP_INTEN</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>CMP1IEN</name>
                            <description>CMP1IEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP2IEN</name>
                            <description>CMP2IEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP3IEN</name>
                            <description>CMP3IEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_INTSTS</name>
                    <displayName>COMP_INTSTS</displayName>
                    <description>COMP_INTSTS</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>CMP1IS</name>
                            <description>CMP1IS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP2IS</name>
                            <description>CMP2IS</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP3IS</name>
                            <description>CMP3IS</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_WINMODE</name>
                    <displayName>COMP_WINMODE</displayName>
                    <description>COMP_WINMODE</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>CMP12MD</name>
                            <description>CMP12MD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WINMDINSEL</name>
                            <description>WINMDINSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_LOCK</name>
                    <displayName>COMP_LOCK</displayName>
                    <description>COMP_LOCK</description>
                    <addressOffset>0x0c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>CMP1LK</name>
                            <description>CMP1LK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP2LK</name>
                            <description>CMP2LK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMP3LK</name>
                            <description>CMP3LK</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP1_CTRL</name>
                    <displayName>COMP1_CTRL</displayName>
                    <description>COMP1_CTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001bffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUTTRG</name>
                            <description>OUTSEL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRMD</name>
                            <description>PWRMD</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKSEL</name>
                            <description>CLKSEL</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP1_FILC</name>
                    <displayName>COMP1_FILC</displayName>
                    <description>COMP1_FILC</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP1_FILP</name>
                    <displayName>COMP1_FILP</displayName>
                    <description>COMP1_FILP</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_CTRL</name>
                    <displayName>COMP2_CTRL</displayName>
                    <description>COMP2_CTRL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0007ffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUTTRG</name>
                            <description>OUTSEL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WINOUT</name>
                            <description>WINOUT</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_FILC</name>
                    <displayName>COMP2_FILC</displayName>
                    <description>COMP2_FILC</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_FILP</name>
                    <displayName>COMP2_FILP</displayName>
                    <description>COMP2_FILP</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP3_CTRL</name>
                    <displayName>COMP3_CTRL</displayName>
                    <description>COMP3_CTRL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0003ffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUTTRG</name>
                            <description>OUTSEL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP3_FILC</name>
                    <displayName>COMP3_FILC</displayName>
                    <description>COMP3_FILC</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP3_FILP</name>
                    <displayName>COMP3_FILP</displayName>
                    <description>COMP3_FILP</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_INVREF</name>
                    <displayName>COMP_INVREF</displayName>
                    <description>COMP_INVREF</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>VREF1EN</name>
                            <description>VREF1EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VREF1SEL</name>
                            <description>VREF1SEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>VREF2EN</name>
                            <description>VREF2EN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VREF2SEL</name>
                            <description>VREF2SEL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
