ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G032/N32G032.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="LPUART1">
            <name>LPUART2</name>
            <baseAddress>0x40004C00</baseAddress>
            <interrupt>
                <name>LPUART1_2</name>
                <description>LPUART1/2 global interrupt</description>
                <value>29</value>
            </interrupt>
        </peripheral>

        <peripheral>
            <name>OPAMP</name>
            <description>operational amplifier</description>
            <groupName>OPAMP</groupName>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>OPAMP_CS</name>
                    <displayName>OPAMP_CS</displayName>
                    <description>OPAMP_CS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MOD</name>
                            <description>MOD</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PGAGAN</name>
                            <description>PGAGAN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>VMSEL</name>
                            <description>VMSEL</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>VPSEL</name>
                            <description>VPSEL</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>TCMEN</name>
                            <description>TCMEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VMSSEL</name>
                            <description>VMSSEL</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
						<field>
                            <name>VPSSEL</name>
                            <description>VPSSEL</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OPAMP_LOCK</name>
                    <displayName>OPAMP_LOCK</displayName>
                    <description>OPAMP_LOCK</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>OPAMPLK</name>
                            <description>OPAMPLK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register> 
            </registers>
        </peripheral>

        <peripheral>
            <name>PWR</name>
            <description>Power control</description>
            <groupName>PWR</groupName>
            <baseAddress>0x40007000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PVD</name>
                <description>PVD through EXTI line detection interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>PWR_CTRL1</name>
                    <displayName>PWR_CTRL</displayName>
                    <description>PWR_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <resetMask>0x000007fe</resetMask>
                    <fields>
                        <field>
                            <name>__PDSTOP</name>
                            <description>__PDSTOP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>__CLRWKUPF</name>
                            <description>__CLRWKUPF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>__CLRDBGPDF</name>
                            <description>__CLRDBGPDF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>__PVDEN</name>
                            <description>__PVDEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>__PLS</name>
                            <description>__PLS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>__PDR</name>
                            <description>__PDR</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>__STOPPLUSEN</name>
                            <description>__STOPPLUSEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRLSTS</name>
                    <displayName>PWR_CTRLSTS</displayName>
                    <description>PWR_CTRLSTS</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000800</resetValue>
                    <resetMask>0x00000f07</resetMask>
                    <fields>
                        <field>
                            <name>WKUPF</name>
                            <description>WKUPF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBGPDF</name>
                            <description>DBGPDF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDO</name>
                            <description>PVDO</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP0EN</name>
                            <description>WKUP0EN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP1EN</name>
                            <description>WKUP1EN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP2EN</name>
                            <description>WKUP2EN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPPOL</name>
                            <description>WKUPPOL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL2</name>
                    <displayName>PWR_CTRL2</displayName>
                    <description>PWR_CTRL2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000400</resetValue>
                    <resetMask>0x00000400</resetMask>
                    <fields>
                        <field>
                            <name>IWDGRSTEN</name>
                            <description>IWDGRSTEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL3</name>
                    <displayName>PWR_CTRL3</displayName>
                    <description>PWR_CTRL3</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000037f</resetValue>
                    <resetMask>0x00000080</resetMask>
                    <fields>
                        <field>
                            <name>LSIEN</name>
                            <description>LSIEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL4</name>
                    <displayName>PWR_CTRL4</displayName>
                    <description>PWR_CTRL4</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000020</resetValue>
                    <resetMask>0x00000073</resetMask>
                    <fields>
                        <field>
                            <name>FLASHWKUP</name>
                            <description>FLASHWKUP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STBFLASH</name>
                            <description>STBFLASH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPRUNEN</name>
                            <description>LPRUNEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPRUNFLH</name>
                            <description>LPRUNFLH</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPRUNSTS</name>
                            <description>LPRUNSTS</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL5</name>
                    <displayName>PWR_CTRL5</displayName>
                    <description>PWR_CTRL5</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000007</resetValue>
                    <resetMask>0x000000c0</resetMask>
                    <fields>
                        <field>
                            <name>SLPMRSEL</name>
                            <description>SLPMRSEL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL6</name>
                    <displayName>PWR_CTRL6</displayName>
                    <description>PWR_CTRL6</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000c0</resetMask>
                    <fields>
                        <field>
                            <name>STPMREN</name>
                            <description>STPMREN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
	                </register>
                <register>		
	                <name>DBG_CTRL</name>
                    <displayName>DBG_CTRL</displayName>
                    <description>DBG_CTRL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fff06</resetMask>
                    <fields>
                        <field>
                            <name>STOP</name>
                            <description>STOP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD</name>
                            <description>PD</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGSTP</name>
                            <description>IWDGSTP</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDGSTP</name>
                            <description>WWDGSTP</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1STP</name>
                            <description>TIM1STP</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3STP</name>
                            <description>TIM3STP</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4STP</name>
                            <description>TIM4STP</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CANSTP</name>
                            <description>CANSTP</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1TIMOUT</name>
                            <description>I2C1TIMOUT</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2TIMOUT</name>
                            <description>I2C2TIMOUT</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM8STP</name>
                            <description>TIM8STP</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM6STP</name>
                            <description>TIM6STP</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
	                </register>
